# 초성
LEADING_CONSONANTS = [
    "L_0", "L_1", "L_2", "L_3", "L_4", "L_5", "L_6", "L_7", "L_8",
    "L_9", "L_10", "L_11", "L_12", "L_13", "L_14", "L_15", "L_16",
    "L_17", "L_18"
]

# 중성
VOWELS = [
    "V_0", "V_1", "V_2", "V_3", "V_4", "V_5", "V_6", "V_7", "V_8",
    "V_9", "V_10", "V_11", "V_12", "V_13", "V_14", "V_15", "V_16",
    "V_17", "V_18", "V_19", "V_20"
]

# 종성
TRAILING_CONSONANTS = [
    None,
    "T_1", "T_2", "T_3", "T_4", "T_5", "T_6", "T_7", "T_8", "T_9",
    "T_10", "T_11", "T_12", "T_13", "T_14", "T_15", "T_16", "T_17",
    "T_18", "T_19", "T_20", "T_21", "T_22", "T_23", "T_24", "T_25",
    "T_26", "T_27"
]

# 자모
JAMO_MAP = {
    0x3131: "L_0_jamo",  # ㄱ
    0x3132: "L_1_jamo",  # ㄲ
    0x3134: "L_2_jamo",  # ㄴ
    0x3137: "L_3_jamo",  # ㄷ
    0x3138: "L_4_jamo",  # ㄸ
    0x3139: "L_5_jamo",  # ㄹ
    0x3141: "L_6_jamo",  # ㅁ
    0x3142: "L_7_jamo",  # ㅂ
    0x3143: "L_8_jamo",  # ㅃ
    0x3145: "L_9_jamo",  # ㅅ
    0x3146: "L_10_jamo",  # ㅆ
    0x3147: "L_11_jamo",  # ㅇ
    0x3148: "L_12_jamo",  # ㅈ
    0x3149: "L_13_jamo",  # ㅉ
    0x314A: "L_14_jamo",  # ㅊ
    0x314B: "L_15_jamo",  # ㅋ
    0x314C: "L_16_jamo",  # ㅌ
    0x314D: "L_17_jamo",  # ㅍ
    0x314E: "L_18_jamo",  # ㅎ
    0x314F: "V_0_jamo",  # ㅏ
    0x3150: "V_1_jamo",  # ㅐ
    0x3151: "V_2_jamo",  # ㅑ
    0x3152: "V_3_jamo",  # ㅒ
    0x3153: "V_4_jamo",  # ㅓ
    0x3154: "V_5_jamo",  # ㅔ
    0x3155: "V_6_jamo",  # ㅕ
    0x3156: "V_7_jamo",  # ㅖ
    0x3157: "V_8_jamo",  # ㅗ
    0x3158: "V_9_jamo",  # ㅘ
    0x3159: "V_10_jamo",  # ㅙ
    0x315A: "V_11_jamo",  # ㅚ
    0x315B: "V_12_jamo",  # ㅛ
    0x315C: "V_13_jamo",  # ㅜ
    0x315D: "V_14_jamo",  # ㅝ
    0x315E: "V_15_jamo",  # ㅞ
    0x315F: "V_16_jamo",  # ㅟ
    0x3160: "V_17_jamo",  # ㅠ
    0x3161: "V_18_jamo",  # ㅡ
    0x3162: "V_19_jamo",  # ㅢ
    0x3163: "V_20_jamo",  # ㅣ
}

# 세로 모음 (Type 1, 4)
VOWEL_TYPE_VERTICAL_IDX = {0, 1, 2, 3, 4, 5, 6, 7, 20}
# (ㅏ, ㅐ, ㅑ, ㅒ, ㅓ, ㅔ, ㅕ, ㅖ, ㅣ)


# 가로 모음 (Type 2, 5)
VOWEL_TYPE_HORIZONTAL_IDX = {8, 12, 13, 17, 18}
# (ㅗ, ㅛ, ㅜ, ㅠ, ㅡ)

# 복합 모음 (Type 3, 6)
VOWEL_TYPE_MIXED_IDX = {9, 10, 11, 14, 15, 16, 19}
# (ㅘ, ㅙ, ㅚ, ㅝ, ㅞ, ㅟ, ㅢ)
